zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1186/gcc/startup_MIMXRT1186_cm33.S
    .long   SINC2_CH2_IRQHandler                            /* SINC Filter Glue 2 channel 2*/
    .long   SINC2_CH3_IRQHandler                            /* SINC Filter Glue 2 channel 3*/
    .long   GPIO4_IRQHandler                                /* GPIO4 interrupt*/
    .long   TMR2_IRQHandler                                 /* TMR2 interrupt*/
    .long   GPIO5_IRQHandler                                /* GPIO5 interrupt*/
    .long   ASRC_IRQHandler                                 /* ASRC interrupt*/
    .long   GPIO6_IRQHandler                                /* GPIO6 interrupt*/
    .long   DBG_TRACE_IRQHandler                            /* JTAGSW DAP MDM-AP SRC reset source*/
    .long   ECAT_RST_OUT_IRQHandler                         /* ECAT reset out interrupt*/
    .long   DefaultISR                                      /* 255*/

    .size   __isr_vector, . - __isr_vector

    .text
    .thumb

#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#endif
#endif
/* Reset Handler */

    .thumb_func
    .align 2
    .globl   Reset_Handler
    .weak    Reset_Handler
    .type    Reset_Handler, %function
Reset_Handler:
    cpsid   i               /* Mask interrupts */
    .equ    VTOR, 0xE000ED08
    ldr     r0, =VTOR
    ldr     r1, =__isr_vector
    str     r1, [r0]
    ldr     r2, [r1]
    msr     msp, r2
    ldr     r0, =__StackLimit
    msr     msplim, r0
#ifndef __NO_SYSTEM_INIT
    ldr   r0,=SystemInit
    blx   r0
#endif
/*    Loop to copy data from read only memory to RAM. The ranges of copy
 *    from/to are specified by following symbols evaluated in linker script.
 *      1. __data_flash_start/__data_start__/__data_end__
 *      2. __ram_function_flash_start/__ram_function_start__/__ram_function_end__
 *      3. __noncache_data_flash_start/__noncache_data_start__/__noncache_data_end__
 *      4. __qadata_flash_start/__qadata_start__/__qadata_end__
 *
 *      Note: All must be aligned to 4 bytes boundary.
 */

    ldr    r1, =__data_flash_start
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__
#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs   r3, r2
    ble    .LC1
.LC0:
    subs   r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC0
.LC1:
#else  /* code size implemenation */
.LC0:
    cmp    r2, r3
    ittt   lt
    ldrlt  r0, [r1], #4
    strlt  r0, [r2], #4
    blt    .LC0
#endif

#ifdef __STARTUP_INITIALIZE_RAMFUNCTION
    ldr    r1, =__ram_function_flash_start
    ldr    r2, =__ram_function_start__
    ldr    r3, =__ram_function_end__
#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs   r3, r2
    ble    .LC_ramfunc_copy_end
.LC_ramfunc_copy_start:
    subs   r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC_ramfunc_copy_start
.LC_ramfunc_copy_end:
#else  /* code size implemenation */
.LC_ramfunc_copy_start:
    cmp    r2, r3
    ittt   lt
    ldrlt  r0, [r1], #4
    strlt  r0, [r2], #4
    blt    .LC_ramfunc_copy_start
#endif
#endif /* __STARTUP_INITIALIZE_RAMFUNCTION */

#ifdef __STARTUP_INITIALIZE_NONCACHEDATA
    ldr    r1, =__noncache_data_flash_start
    ldr    r2, =__noncache_data_start__
    ldr    r3, =__noncache_data_end__
#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs   r3, r2
    ble    .LC3
.LC2:
    subs   r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC2
.LC3:
#else  /* code size implemenation */
.LC2:
    cmp    r2, r3
    ittt   lt
    ldrlt  r0, [r1], #4
    strlt  r0, [r2], #4
    blt    .LC2
#endif
/* zero inited ncache section initialization */
    ldr    r2, =__noncache_bss_start__
    ldr    r3, =__noncache_bss_end__
    movs   r0,0
.LC4:
    cmp    r2,r3
    itt    lt
    strlt  r0,[r2],#4
    blt    .LC4
#endif /* __STARTUP_INITIALIZE_NONCACHEDATA */

#ifdef __STARTUP_INITIALIZE_QADATA
    ldr    r1, =__qadata_flash_start
    ldr    r2, =__qadata_start__
    ldr    r3, =__qadata_end__
#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs   r3, r2
    ble    .LC_qadata_copy_end
.LC_qadata_copy_start:
    subs   r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC_qadata_copy_start
.LC_qadata_copy_end:
#else  /* code size implemenation */
.LC_qadata_copy_start:
    cmp    r2, r3
    ittt   lt
    ldrlt  r0, [r1], #4
    strlt  r0, [r2], #4
    blt    .LC_qadata_copy_start
#endif
#endif /* __STARTUP_INITIALIZE_QADATA */

#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __bss_start__: start of BSS section. Must align to 4
 *      __bss_end__: end of BSS section. Must align to 4
 */
    ldr    r1, =__bss_start__
    ldr    r2, =__bss_end__
    movs   r0, 0
.LC5:
    cmp    r1, r2
    itt    lt
    strlt  r0, [r1], #4
    blt    .LC5
#endif /* __STARTUP_CLEAR_BSS */

/* Start stack / heap initializaiton */
    movs   r0, 0
    ldr    r1, =__HeapBase
    ldr    r2, =__HeapLimit
.LC6:
    cmp    r1, r2
    itt    lt
    strlt  r0, [r1], #4
    blt    .LC6

    ldr    r1, =__StackLimit
    ldr    r2, =__StackTop
.LC7:
    cmp    r1, r2
    itt    lt
    strlt  r0, [r1], #4
    blt    .LC7
/* End of stack / heap initializaiton */

    cpsie   i               /* Unmask interrupts */
#ifndef __START
#ifdef __REDLIB__
#define __START __main
#else
#define __START _start
#endif
#endif
#ifndef __ATOLLIC__
    ldr   r0,=__START
    blx   r0
#else
    ldr   r0,=__libc_init_array
    blx   r0
    ldr   r0,=main
    bx    r0
#endif
    .pool
    .size Reset_Handler, . - Reset_Handler

